manmuqingshan/openblt/Target/Demo/ARMCM4_STM32F3_Olimexino_STM32F3_Keil/Boot/hooks.c
    case EVENT_ID_ON_SUCCESS:
      /* Write event related information to the log file. */
      if (logFile.canUse == BLT_TRUE)
      {
        sprintf(logStr, "Successfully updated the firmware\n");
        if (f_puts(logStr, &logFile.handle) < 0)
        {
          logFile.canUse = BLT_FALSE;
          f_close(&logFile.handle);
        }
      }
      /* Close the log file. */
      if (logFile.canUse == BLT_TRUE)
      {
        f_close(&logFile.handle);
        logFile.canUse = BLT_FALSE;
      }
      if (update_from_file == BLT_TRUE)
      {
        /* Now delete the firmware file from the disk since the update was successful */
        f_unlink(firmwareFilename);
      }
      break;

    case EVENT_ID_ON_ERROR:
      /* Write event related information to the log file. */
      error_id = ((tEventsInfoError const *)info)->error_id;
      if (logFile.canUse == BLT_TRUE)
      {
        sprintf(logStr, "Error with id #%u detected. Aborting.\n", error_id);
        if (f_puts(logStr, &logFile.handle) < 0)
        {
          logFile.canUse = BLT_FALSE;
          f_close(&logFile.handle);
        }
      }
      /* Close the log file. */
      if (logFile.canUse == BLT_TRUE)
      {
        f_close(&logFile.handle);
        logFile.canUse = BLT_FALSE;
      }
      break;

    default:
      break;  
  }
#endif /* #if (BOOT_FILE_SYS_ENABLE > 0) */
} /*** end of EventsHook ***/
#endif /* BOOT_EVENTS_ENABLE > 0 */


/****************************************************************************************
*   I N F O   T A B L E   C O N F I G U R A T I O N    H O O K   F U N C T I O N S
****************************************************************************************/
#if (BOOT_INFO_TABLE_ENABLE > 0)
/************************************************************************************//**
** \brief     Callback that gets called at the start of the firmware update, before
**            performing erase and program operations on non-volatile flash. It enables
**            you to implement info table comparison logic to determine if the firmware
**            update is allowed to proceed. Could for example be used to make sure a
**            firmware update only goes through if the selected firmware file contains
**            firmware for the correct product type.
** \param     newInfoTable Address of the opaque pointer to the info table that was
**            extracted from the firmware file that was selected for the firmware update.
** \param     oldInfoTable Address of the opaque pointer to the info table of the
**            currently programmed firmware.
** \return    BLT_TRUE if the info table check passed and the firmware update is allowed
**            to proceed. BLT_FALSE if the firmware update is not allowed to proceed.
**
****************************************************************************************/
blt_bool InfoTableCheckHook(blt_addr newInfoTable,  blt_addr currentInfoTable)
{
  blt_bool result = BLT_FALSE;
  /* Important: This structure must have the same layout as the actual info table in the
   * firmware itself.
   */
  struct firmwareInfoTable
  {
    blt_int32u tableId;          /**< fixed value for identification as an info table. */
    blt_int32u productId;        /**< product identification. E.g. 1234 = Airpump.     */
    blt_int32u firmwareVersion;  /**< firmware version. E.g. 10429 = v1.4.29           */
  };

  /* Cast addresses of opaque pointers to info table pointers. */
  struct firmwareInfoTable const * newInfoTablePtr     = (void const *)newInfoTable;
  struct firmwareInfoTable const * currentInfoTablePtr = (void const *)currentInfoTable;

  /* Sanity check on the configured length of the info table at compile time. */
  ASSERT_CT(BOOT_INFO_TABLE_LEN == sizeof(struct firmwareInfoTable));

  /* Do table IDs match? The table ID identifies the tables as firmware info tables. */
  if (currentInfoTablePtr->tableId == newInfoTablePtr->tableId)
  {
    /* Only allow the firmware update to proceed if it's firmware for the same
     * product type.
     */
    if (currentInfoTablePtr->productId == newInfoTablePtr->productId)
    {
      /* Allow the firmware update to proceed. */
      result = BLT_TRUE;
    }
  }

  /* Give the result back to the caller. */
  return result;
} /*** end of InfoTableCheckHook ***/
#endif /* BOOT_INFO_TABLE_ENABLE > 0 */


/****************************************************************************************
*   S E E D / K E Y   S E C U R I T Y   H O O K   F U N C T I O N S
****************************************************************************************/

#if (BOOT_XCP_SEED_KEY_ENABLE > 0)
/************************************************************************************//**
** \brief     Provides a seed to the XCP master that will be used for the key
**            generation when the master attempts to unlock the specified resource.
**            Called by the GET_SEED command.
** \param     resource  Resource that the seed if requested for (XCP_RES_XXX).
** \param     seed      Pointer to byte buffer wher the seed will be stored.
** \return    Length of the seed in bytes.
**
****************************************************************************************/
blt_int8u XcpGetSeedHook(blt_int8u resource, blt_int8u *seed)
{
  /* request seed for unlocking ProGraMming resource */
  if ((resource & XCP_RES_PGM) != 0)
  {
    seed[0] = 0x55;
  }

  /* return seed length */
  return 1;
} /*** end of XcpGetSeedHook ***/


/************************************************************************************//**
** \brief     Called by the UNLOCK command and checks if the key to unlock the
**            specified resource was correct. If so, then the resource protection
**            will be removed.
** \param     resource  resource to unlock (XCP_RES_XXX).
** \param     key       pointer to the byte buffer holding the key.
** \param     len       length of the key in bytes.
** \return    1 if the key was correct, 0 otherwise.
**
****************************************************************************************/
blt_int8u XcpVerifyKeyHook(blt_int8u resource, blt_int8u *key, blt_int8u len)
{
  /* suppress compiler warning for unused parameter */
  len = len;

  /* the example key algorithm in "libseednkey.dll" works as follows:
   *  - PGM will be unlocked if key = seed - 1
   */

  /* check key for unlocking ProGraMming resource */
  if ((resource == XCP_RES_PGM) && (key[0] == (0x55-1)))
  {
    /* correct key received for unlocking PGM resource */
    return 1;
  }

  /* still here so key incorrect */
  return 0;
} /*** end of XcpVerifyKeyHook ***/
#endif /* BOOT_XCP_SEED_KEY_ENABLE > 0 */


/*********************************** end of hooks.c ************************************/
